//3.Дано трехзначное число, напечатать максимальную цифру
#include <stdio.h>

int main()
{
    int a;
    scanf ("%d", &a);
    
    //printf("%d",(a%10) > ((a/10)%10) ? ((a%10) > ((a/100)%10) ? (a%10):((a/100)%10)):(((a/10)%10) > ((a/100)%10) ? ((a/10)%10):((a/100)%10))); //через тернарные
    
    
    int a1,a2,a3;           //через логические с выделением для каждой цифры переменной
    a1=a%10;
    a2=a/10%10;
    a3=a/100%10;
    
    if (a1>a2 && a1>a3)
    printf ("%d",a1);
    if (a2>a1 && a2>a3)
    printf ("%d",a2);
    if (a3>a2 && a3>a1)
    printf ("%d",a3);
    
    return 0;
    
}